function d = gaolan_model2wgh(p,x1,y1,r1,x2,y2,r2,bs)
%用于网格化异常体加密，有两个异常体，都为圆，圆1的圆心在任意位置（x1,y1），半径为r1，圆2的圆心在任意位置（x2,y2），半径为r2。
%bs代表相差的倍数
[m,~]=size(p);
R1=(p(:,1)-x1).^2+(p(:,2)-y1).^2-r1^2;
R2=(p(:,1)-x2).^2+(p(:,2)-y2).^2-r2^2;
l1=p(:,2)-((y2-y1)/(x2-x1)*p(:,1)+y1-x1*(y2-y1)/(x2-x1));
l2=p(:,2)-(y1+y2)/(r1+r2)*r1+(p(:,1)-r1*(x1+x2)/(r1+r2))*(x2-x1)/(y2-y1);
% xa=-(x2-x1)/(y2-y1);xb=(x2-x1)/(y2-y1)*(x1+x2)/(r1+r2)*r2+r2*(y1+y2)/(r1+r2);
% a=xa^2+1;b=2*xa*xb;c=xb^2-1000;
% x3=(-b+sqrt(b^2-4*a*c))/2/a;y3=xa*x3+xb;
% x4=(-b-sqrt(b^2-4*a*c))/2/a;y4=xa*x4+xb;
% l3=p(:,2)-((y4-y1)/(x4-x1)*p(:,1)+y1-x1*(y4-y1)/(x4-x1));
% l4=p(:,2)-((y3-y1)/(x3-x1)*p(:,1)+y1-x1*(y3-y1)/(x3-x1));
% l5=p(:,2)-((y4-y2)/(x4-x2)*p(:,1)+y2-x2*(y4-y2)/(x4-x2));
% l6=p(:,2)-((y3-y2)/(x3-x2)*p(:,1)+y2-x2*(y3-y2)/(x3-x2));

for i=1:1:m
    if l2(i,1)<=0
        d(i,1)=gaolan_fzwgh(p(i,:),x1,y1,r1,bs);
    else
        d(i,1)=gaolan_fzwgh(p(i,:),x2,y2,r2,bs);
    end
end
end

