function d = gaolan_model3wgh(p,x0,y0,ds)
%UNTITLED 此处显示有关此函数的摘要
%   此处显示详细说明
x=p(:,1);y=p(:,2);
[m,~]=size(p);
d1=sqrt(x.^2+y.^2);
cst=abs(y./d1);sit=abs(x./d1);
l1=y0/x0.*x-y;
l2=-y0/x0.*x-y;

d2=1000-abs(y0./cst);d22=1000-abs(x0./sit);
d3=d1+d2-1000;d33=d1+d22-1000;
for i=1:1:m
    if (((l1(i,1)>=0)&&(l2(i,1)>=0))||((l1(i,1)<=0)&&(l2(i,1)<=0)))&&(abs(y(i,1))<=y0)
        d(i,1)=(5-5*ds)/(1000-d2(i,1))*d1(i,1)+5*ds;
    elseif (((l1(i,1)>=0)&&(l2(i,1)>=0))||((l1(i,1)<=0)&&(l2(i,1)<=0)))&&(abs(y(i,1))>y0)
        d(i,1)=(10-10*ds)/d2(i,1)*abs(d3(i,1)-d2(i,1)/2)+5*ds;
    elseif (((l1(i,1)>=0)&&(l2(i,1)<=0))||((l1(i,1)<=0)&&(l2(i,1)>=0)))&&(abs(x(i,1))<=x0)
        d(i,1)=(5-5*ds)/(1000-d22(i,1))*d1(i,1)+5*ds;
    elseif (((l1(i,1)>=0)&&(l2(i,1)<=0))||((l1(i,1)<=0)&&(l2(i,1)>=0)))&&(abs(x(i,1))>x0)
        d(i,1)=(10-10*ds)/d22(i,1)*abs(d33(i,1)-d22(i,1)/2)+5*ds;
    end 
end
end