function d = xishu_model3(p)
%UNTITLED 此处显示有关此函数的摘要
%   此处显示详细说明
x=p(:,1);y=p(:,2);
[m,~]=size(p);
r1=25*sqrt(x.^2+y.^2)./(abs(x));r2=sqrt(x.^2+y.^2)-r1;R=200-r1;rr1=150*sqrt(x.^2+y.^2)./(abs(y));rr2=sqrt(x.^2+y.^2)-rr1;RR=200-rr1;
for i=1:1:m
    if (((y(i,1)<=6*x(i,1))&&(y(i,1)>=-6*x(i,1)))&&(x(i,1)<=25))||(((y(i,1)>=6*x(i,1))&&(y(i,1)<=-6*x(i,1)))&&(x(i,1)>=-25))
        d(i,1)=60-48/25*abs(x(i,1));
    else if (((y(i,1)>=6*x(i,1))&&(y(i,1)>=-6*x(i,1)))&&(y(i,1)<=150))||(((y(i,1)<=6*x(i,1))&&(y(i,1)<=-6*x(i,1)))&&(y(i,1)>=-150))
            d(i,1)=60-8/25*abs(y(i,1));
        else if (((y(i,1)<=6*x(i,1))&&(y(i,1)>=-6*x(i,1)))&&(x(i,1)>25))||(((y(i,1)>=6*x(i,1))&&(y(i,1)<=-6*x(i,1)))&&(x(i,1)<-25))
                d(i,1)=-96/R(i,1)*abs(r2(i,1)-R(i,1)/2)+60;
            else if (((y(i,1)>=6*x(i,1))&&(y(i,1)>=-6*x(i,1)))&&(y(i,1)>150))||(((y(i,1)<=6*x(i,1))&&(y(i,1)<=-6*x(i,1)))&&(y(i,1)<-150))
                    d(i,1)=-96/RR(i,1)*abs(rr2(i,1)-RR(i,1)/2)+60;
                end
            end
        end
    end
end



end
