function d = gl_f_model1(p)
%UNTITLED 此处显示有关此函数的摘要
%   此处显示详细说明
x=p(:,1);y=p(:,2);
R11=1000;R22=80/2/(195/2)*1000;R33=9.86/2/(195/2)*1000;
R1=199.5/2;%树的半径,单位为毫米
R2=80/2;%高阻半径，单位为毫米
R3=9.86/2;%铜棒半径，单位为毫米
rx=0.5*(R11+R22)*cos(357/180*pi);ry=0.5*(R11+R22)*sin(357/180*pi);
[m,~]=size(p);l=sqrt(x.^2+y.^2);
for i=1:1:m
   if l(i,1)>=R22
       d(i,1)=36/(R22-R11)*abs(l(i,1)-0.5*(R11+R22))+23;
   else
       d(i,1)=25-20/R22*l(i,1);
   end
end
x1=25-20/(((R11+R22)/2)^2)*((R11+R22)/2-0.5*(R11+R22));
x2=25-20/(((R11+R22)/2)^2)*((R11+R22)/2+R3-0.5*(R11+R22));
d=d./(5/x2/exp(1)*exp(1./(1+abs((x-rx).^2+(y-ry).^2-R3^2)).^0.02));
end

