%用于计算装置系数，涉及I=1A,r=1m,rho=1ohm。
clear
clc
arc=11.25*1;
R=1000;%树的半径,单位为毫米
for i=1:1:360
    gd(i,1)=R*cos((i-1)/180*pi);
    gd(i,2)=R*sin((i-1)/180*pi);
end
IK=[R*cos(arc/180*pi) R*sin(arc/180*pi) -1;1000 0 1];
fd=@(p) p(:,1).^2+p(:,2).^2-1000000;%定义模型的边界，在内小宇0，在外大于0
% % %fh=@(p) ((abs(p(:,1))-1000).^2+p(:,2).^2)/20000+10;%定义网格稀疏程度的函数
fh=@(p) abs(sqrt(p(:,1).^2+p(:,2).^2)-1000)/20+5;%定义网格稀疏程度的函数
[p,t]=distmesh2d(fd,fh,6,[-1000,-1000;1000,1000],[gd;IK(:,1:2)]);%网格化函数，distmesh2d（模型边界，稀疏程度函数，稀疏程度比例，[xmin,ymin;xmax,ymax],固定的节点坐标信息[1 2;2 0;2 9]可固定三个节点）
%网格化xishu
%load('p15732.mat');load('t15732.mat');%11107对应半径0.5米,10461对应半径0.3米,7677和28873都对应的半径为1米[m,~]=size(gd);15732对应半径为1米
[m,n]=size(t);
[m1,n1]=size(p);um=zeros(360,1);
for i=1:1:360
    um(i,1)=gaolan_minln( p,gd(i,:)); 
end
rho=ones(m,1)*1000;
minln1=gminln( p,[IK(1,1),IK(1,2)]);
minln2=gminln( p,[IK(2,1),IK(2,2)]);
V=zeros(m1,6);
h=waitbar(0,'Please wait...');
ki=[0.28169478166253;1.23307922027198;2.92914084280439;7.33169758009634;19.0994312736139;61.0501925611096];
gi=[0.473003687021518;0.668073888859553;1.71519015717925;4.27824762035893;12.8634683725027;47.2402615641217];
 for i=1:1:6
     K=gaolan_K(rho,p,t,ki(i,1));
     I=zeros(m1,1);
     I(minln1,1)=IK(1,3);I(minln2,1)=IK(2,3);
     V(:,i)=K^(-1)*I;   
     waitbar(i/6)
 end
v=V(um,:);
u=V*gi;
save u1125
xlswrite('u1125.xlsx',u);